#  Break   /  شکست


# هر گاه قصد اتمام و شکست زنجیره ای را داشته باشیم استفاده میکنیم break از


#x = 1
#while x < 20 :
#    print (x)
#    x += 1
    
# در این حال ایکس تا عدد بیست نمایش داده میشود


#x = 1
#while x < 40 :
#    print (x)
#    x += 2
    
# در این حالت اعداد از یک شروع شده و در هر مرحله دو واحد به ان اضافه میشود



#x = 2
#while x < 50 :
#    print (x)
#    x += 2
#    if x == 34 :
#        brake

# در اینجا وقتی زنجیره به 34 برسد شکسته میشود و دیگر نمایش داده نمیشود


#x = 2
#while x < 60 :
#    print (x)
#    x *= 2
#    if x == 32 :
#        break
    
#print ( " Mohasebat tamam shod " ) 
#print ( " ................ " )